{
  "plugins": {
    "agentic.nvim": {
      "src": "https://github.com/carlos-algms/agentic.nvim"
    },
    "aniseed": {
      "src": "https://github.com/Olical/aniseed"
    },
    "antifennel-nvim": {
      "src": "https://github.com/elkowar/antifennel-nvim"
    },
    "auth.nvim": {
      "src": "file:///home/zfc/repo/auth.nvim",
      "version": "'G'"
    },
    "authinfo.nvim": {
      "src": "https://github.com/zhafacai/authinfo.nvim"
    },
    "better-escape.nvim": {
      "src": "https://github.com/max397574/better-escape.nvim"
    },
    "better_escape": {
      "src": "https://github.com/max397574/better-escape.nvim"
    },
    "blink-emoji": {
      "src": "https://github.com/moyiz/blink-emoji.nvim"
    },
    "blink-emoji.nvim": {
      "src": "https://github.com/moyiz/blink-emoji.nvim"
    },
    "blink-ripgrep": {
      "src": "https://github.com/mikavilpas/blink-ripgrep.nvim"
    },
    "blink-ripgrep.nvim": {
      "src": "https://github.com/mikavilpas/blink-ripgrep.nvim"
    },
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp",
      "version": ">=0.0.0"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "ccc": {
      "src": "https://github.com/uga-rosa/ccc.nvim"
    },
    "ccc.nvim": {
      "src": "https://github.com/uga-rosa/ccc.nvim"
    },
    "chainsaw": {
      "src": "https://github.com/chrisgrieser/nvim-chainsaw"
    },
    "clangd_extensions": {
      "src": "https://github.com/dchinmay2/clangd_extensions.nvim"
    },
    "clangd_extensions.nvim": {
      "src": "https://github.com/dchinmay2/clangd_extensions.nvim"
    },
    "codecompanion": {
      "src": "https://github.com/olimorris/codecompanion.nvim"
    },
    "codecompanion.nvim": {
      "src": "https://github.com/olimorris/codecompanion.nvim"
    },
    "codediff": {
      "src": "https://github.com/esmuellert/codediff.nvim"
    },
    "codediff.nvim": {
      "src": "https://github.com/esmuellert/codediff.nvim"
    },
    "colorful-menu": {
      "src": "https://github.com/xzbdmw/colorful-menu.nvim"
    },
    "colorful-menu.nvim": {
      "src": "https://github.com/xzbdmw/colorful-menu.nvim"
    },
    "colorizer": {
      "src": "https://github.com/catgoose/nvim-colorizer.lua"
    },
    "conform": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "conjure": {
      "src": "https://github.com/Olical/conjure"
    },
    "debugprint.nvim": {
      "src": "https://github.com/andrewferrier/debugprint.nvim"
    },
    "denote": {
      "src": "https://github.com/zhafacai/denote.nvim",
      "version": "'uiselect'"
    },
    "denote.nvim": {
      "src": "https://github.com/zhafacai/denote.nvim",
      "version": "'uiselect'"
    },
    "dial.nvim": {
      "src": "https://github.com/monaqa/dial.nvim"
    },
    "dropbar": {
      "src": "https://github.com/Bekaboo/dropbar.nvim"
    },
    "dropbar.nvim": {
      "src": "https://github.com/Bekaboo/dropbar.nvim"
    },
    "emission": {
      "src": "https://github.com/aileot/emission.nvim"
    },
    "emission.nvim": {
      "src": "https://github.com/aileot/emission.nvim"
    },
    "everforest": {
      "src": "https://github.com/sainnhe/everforest"
    },
    "everviolet": {
      "src": "https://github.com/everviolet/nvim"
    },
    "fennel": {
      "src": "https://git.sr.ht/~technomancy/fennel"
    },
    "flash": {
      "src": "https://github.com/folke/flash.nvim"
    },
    "flash.nvim": {
      "src": "https://github.com/folke/flash.nvim"
    },
    "floaterm": {
      "src": "https://github.com/nvzone/floaterm"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets"
    },
    "gpg": {
      "src": "https://github.com/benoror/gpg.nvim"
    },
    "gpg.nvim": {
      "src": "https://github.com/benoror/gpg.nvim"
    },
    "grug-far": {
      "src": "https://github.com/MagicDuck/grug-far.nvim"
    },
    "grug-far.nvim": {
      "src": "https://github.com/MagicDuck/grug-far.nvim"
    },
    "gruvbox": {
      "src": "https://github.com/ellisonleao/gruvbox.nvim"
    },
    "gruvbox.nvim": {
      "src": "https://github.com/ellisonleao/gruvbox.nvim"
    },
    "helpview": {
      "src": "https://github.com/OXY2DEV/helpview.nvim"
    },
    "helpview.nvim": {
      "src": "https://github.com/OXY2DEV/helpview.nvim"
    },
    "hlslens": {
      "src": "https://github.com/kevinhwang91/nvim-hlslens"
    },
    "img-clip": {
      "src": "https://github.com/HakonHarnes/img-clip.nvim"
    },
    "img-clip.nvim": {
      "src": "https://github.com/HakonHarnes/img-clip.nvim"
    },
    "incline": {
      "src": "https://github.com/b0o/incline.nvim"
    },
    "incline.nvim": {
      "src": "https://github.com/b0o/incline.nvim"
    },
    "kanagawa": {
      "src": "https://github.com/rebelot/kanagawa.nvim"
    },
    "kanagawa.nvim": {
      "src": "https://github.com/rebelot/kanagawa.nvim"
    },
    "lazydev": {
      "src": "https://github.com/folke/lazydev.nvim"
    },
    "lazydev.nvim": {
      "src": "https://github.com/folke/lazydev.nvim"
    },
    "lspkind": {
      "src": "https://github.com/onsails/lspkind.nvim"
    },
    "lspkind.nvim": {
      "src": "https://github.com/onsails/lspkind.nvim"
    },
    "markview": {
      "src": "https://github.com/OXY2DEV/markview.nvim"
    },
    "markview.nvim": {
      "src": "https://github.com/OXY2DEV/markview.nvim"
    },
    "mini-git": {
      "src": "https://github.com/nvim-mini/mini-git"
    },
    "mini.align": {
      "src": "https://github.com/nvim-mini/mini.align"
    },
    "mini.bracketed": {
      "src": "https://github.com/nvim-mini/mini.bracketed"
    },
    "mini.clue": {
      "src": "https://github.com/nvim-mini/mini.clue"
    },
    "mini.cursorword": {
      "src": "https://github.com/nvim-mini/mini.cursorword"
    },
    "mini.diff": {
      "src": "https://github.com/nvim-mini/mini.diff"
    },
    "mini.git": {
      "src": "https://github.com/nvim-mini/mini-git"
    },
    "mini.icons": {
      "src": "https://github.com/nvim-mini/mini.icons"
    },
    "mini.indentscope": {
      "src": "https://github.com/nvim-mini/mini.indentscope"
    },
    "mini.move": {
      "src": "https://github.com/nvim-mini/mini.move"
    },
    "mini.notify": {
      "src": "https://github.com/nvim-mini/mini.notify"
    },
    "mini.operators": {
      "src": "https://github.com/nvim-mini/mini.operators"
    },
    "mini.pairs": {
      "src": "https://github.com/nvim-mini/mini.pairs"
    },
    "mini.pick": {
      "src": "https://github.com/nvim-mini/mini.pick"
    },
    "mini.sessions": {
      "src": "https://github.com/nvim-mini/mini.sessions"
    },
    "mini.splitjoin": {
      "src": "https://github.com/nvim-mini/mini.splitjoin"
    },
    "mini.starter": {
      "src": "https://github.com/nvim-mini/mini.starter"
    },
    "mini.statusline": {
      "src": "https://github.com/nvim-mini/mini.statusline"
    },
    "mini.surround": {
      "src": "https://github.com/nvim-mini/mini.surround"
    },
    "modus-themes": {
      "src": "https://github.com/miikanissi/modus-themes.nvim"
    },
    "modus-themes.nvim": {
      "src": "https://github.com/miikanissi/modus-themes.nvim"
    },
    "moonbit": {
      "src": "https://github.com/moonbit-community/moonbit.nvim"
    },
    "moonbit.nvim": {
      "src": "https://github.com/moonbit-community/moonbit.nvim"
    },
    "neogit": {
      "src": "https://github.com/NeogitOrg/neogit"
    },
    "neotest": {
      "src": "https://github.com/nvim-neotest/neotest"
    },
    "neotest-python": {
      "src": "https://github.com/nvim-neotest/neotest-python"
    },
    "neotest-vitest": {
      "src": "https://github.com/marilari88/neotest-vitest"
    },
    "nfnl": {
      "src": "https://github.com/Olical/nfnl"
    },
    "nordic": {
      "src": "https://github.com/AlexvZyl/nordic.nvim"
    },
    "nordic.nvim": {
      "src": "https://github.com/AlexvZyl/nordic.nvim"
    },
    "numb": {
      "src": "https://github.com/nacro90/numb.nvim"
    },
    "numb.nvim": {
      "src": "https://github.com/nacro90/numb.nvim"
    },
    "nvim": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "nvim-autopairs": {
      "src": "https://github.com/windwp/nvim-autopairs"
    },
    "nvim-bqf": {
      "src": "https://github.com/kevinhwang91/nvim-bqf"
    },
    "nvim-chainsaw": {
      "src": "https://github.com/chrisgrieser/nvim-chainsaw"
    },
    "nvim-colorizer.lua": {
      "src": "https://github.com/catgoose/nvim-colorizer.lua"
    },
    "nvim-hlslens": {
      "src": "https://github.com/kevinhwang91/nvim-hlslens"
    },
    "nvim-lint": {
      "src": "https://github.com/mfussenegger/nvim-lint"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-nio": {
      "src": "https://github.com/nvim-neotest/nvim-nio"
    },
    "nvim-origami": {
      "src": "https://github.com/chrisgrieser/nvim-origami"
    },
    "nvim-puppeteer": {
      "src": "https://github.com/chrisgrieser/nvim-puppeteer"
    },
    "nvim-scissors": {
      "src": "https://github.com/chrisgrieser/nvim-scissors"
    },
    "nvim-spider": {
      "src": "https://github.com/chrisgrieser/nvim-spider"
    },
    "nvim-surround": {
      "src": "https://github.com/kylechui/nvim-surround"
    },
    "nvim-thyme": {
      "src": "https://github.com/aileot/nvim-thyme"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-ts-autotag": {
      "src": "https://github.com/windwp/nvim-ts-autotag"
    },
    "nvim-various-textobjs": {
      "src": "https://github.com/chrisgrieser/nvim-various-textobjs"
    },
    "octo.nvim": {
      "src": "https://github.com/pwntester/octo.nvim"
    },
    "oil": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "org-bullets": {
      "src": "https://github.com/nvim-orgmode/org-bullets.nvim"
    },
    "org-bullets.nvim": {
      "src": "https://github.com/nvim-orgmode/org-bullets.nvim"
    },
    "org-cycle-lite.nvim": {
      "src": "https://github.com/aaratha/org-cycle-lite.nvim"
    },
    "org-super-agenda": {
      "src": "https://github.com/hamidi-dev/org-super-agenda.nvim"
    },
    "org-super-agenda.nvim": {
      "src": "https://github.com/zhafacai/org-super-agenda.nvim",
      "version": "'fix/close-window-cleanly'"
    },
    "orgmode": {
      "src": "https://github.com/nvim-orgmode/orgmode"
    },
    "origami": {
      "src": "https://github.com/chrisgrieser/nvim-origami"
    },
    "oxocarbon": {
      "src": "https://github.com/nyoom-engineering/oxocarbon.nvim"
    },
    "oxocarbon.nvim": {
      "src": "https://github.com/nyoom-engineering/oxocarbon.nvim"
    },
    "paperplanes": {
      "src": "https://github.com/rktjmp/paperplanes.nvim"
    },
    "paperplanes.nvim": {
      "src": "https://github.com/rktjmp/paperplanes.nvim"
    },
    "parinfer-rust": {
      "src": "https://github.com/eraserhd/parinfer-rust"
    },
    "plenary": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "privymd.nvim": {
      "src": "https://github.com/icarios-dev/privymd.nvim"
    },
    "rustaceanvim": {
      "src": "https://github.com/mrcjkb/rustaceanvim"
    },
    "satellite": {
      "src": "https://github.com/lewis6991/satellite.nvim"
    },
    "satellite.nvim": {
      "src": "https://github.com/lewis6991/satellite.nvim"
    },
    "schemastore": {
      "src": "https://github.com/b0o/schemastore.nvim"
    },
    "schemastore.nvim": {
      "src": "https://github.com/b0o/schemastore.nvim"
    },
    "snacks": {
      "src": "https://github.com/folke/snacks.nvim"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim"
    },
    "telescope-orgmode": {
      "src": "https://github.com/nvim-orgmode/telescope-orgmode.nvim"
    },
    "telescope-orgmode.nvim": {
      "src": "https://github.com/nvim-orgmode/telescope-orgmode.nvim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "tiny-code-action": {
      "src": "https://github.com/rachartier/tiny-code-action.nvim"
    },
    "tiny-code-action.nvim": {
      "src": "https://github.com/rachartier/tiny-code-action.nvim"
    },
    "tiny-inline-diagnostic": {
      "src": "https://github.com/rachartier/tiny-inline-diagnostic.nvim"
    },
    "tiny-inline-diagnostic.nvim": {
      "src": "https://github.com/rachartier/tiny-inline-diagnostic.nvim"
    },
    "todo-comments": {
      "src": "https://github.com/folke/todo-comments.nvim"
    },
    "todo-comments.nvim": {
      "src": "https://github.com/folke/todo-comments.nvim"
    },
    "tokyonight": {
      "src": "https://github.com/folke/tokyonight.nvim"
    },
    "tokyonight.nvim": {
      "src": "https://github.com/folke/tokyonight.nvim"
    },
    "treesj": {
      "src": "https://github.com/Wansmer/treesj"
    },
    "ts-comments": {
      "src": "https://github.com/folke/ts-comments.nvim"
    },
    "ts-comments.nvim": {
      "src": "https://github.com/folke/ts-comments.nvim"
    },
    "various-textobjs": {
      "src": "https://github.com/chrisgrieser/nvim-various-textobjs"
    },
    "vim-dadbod": {
      "src": "https://github.com/tpope/vim-dadbod"
    },
    "vim-dadbod-completion": {
      "src": "https://github.com/kristijanhusak/vim-dadbod-completion"
    },
    "vim-dadbod-ui": {
      "src": "https://github.com/kristijanhusak/vim-dadbod-ui"
    },
    "vim-lastplace": {
      "src": "https://github.com/farmergreg/vim-lastplace"
    },
    "vim-suda": {
      "src": "https://github.com/lambdalisue/vim-suda"
    },
    "volt": {
      "src": "https://github.com/nvzone/volt"
    },
    "which-key": {
      "src": "https://github.com/folke/which-key.nvim"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim"
    },
    "yazi": {
      "src": "https://github.com/mikavilpas/yazi.nvim"
    },
    "yazi.nvim": {
      "src": "https://github.com/mikavilpas/yazi.nvim"
    }
  }
}
